# BuiltInFailures.WallJoinFailures Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..WallJoinFailures Class
BuiltInFailures Class Members See Also
---
Failures about WallJoin.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static class WallJoinFailures
```

Visual Basic
---
```text
Public NotInheritable Class WallJoinFailures
```

Visual C++
---
```text
public ref class WallJoinFailures abstract sealed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..BuiltInFailures..::..WallJoinFailures
# See Also
BuiltInFailures..::..WallJoinFailures Members
Autodesk.Revit.DB Namespace